#### 📖 Terraform Plan ('infra-io/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
module.functions_cgn_card.module.function_cgn_card_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_subnet.cgn_common_subnet_01 will be created
  + resource "azurerm_subnet" "cgn_common_subnet_01" {
      + address_prefixes                               = [
          + "10.20.28.0/26",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "io-p-itn-cgn-common-snet-01"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "io-p-itn-common-rg-01"
      + service_endpoints                              = [
          + "Microsoft.CosmosDB",
          + "Microsoft.Storage",
          + "Microsoft.Web",
        ]
      + virtual_network_name                           = "io-p-itn-common-vnet-01"

      + delegation {
          + name = "default"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.Web/serverFarms"
            }
        }
    }

  # azurerm_subnet.cgn_func_search_subnet_01 will be created
  + resource "azurerm_subnet" "cgn_func_search_subnet_01" {
      + address_prefixes                               = [
          + "10.20.28.64/26",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "io-p-itn-cgn-func-search-snet-01"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "io-p-itn-common-rg-01"
      + service_endpoints                              = [
          + "Microsoft.CosmosDB",
          + "Microsoft.Storage",
          + "Microsoft.Web",
        ]
      + virtual_network_name                           = "io-p-itn-common-vnet-01"

      + delegation {
          + name = "default"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.Web/serverFarms"
            }
        }
    }

  # module.functions_cgn_search.module.function_app_cgn_search.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Web/sites/io-p-itn-cgn-search-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO CGN"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (30 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min             = 0 -> 2
            # (33 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.redis_cgn.azurerm_redis_cache.this,
  on .terraform/modules/redis_cgn/redis_cache/main.tf line 7, in resource "azurerm_redis_cache" "this":
   7:   enable_non_ssl_port           = var.enable_non_ssl_port

`enable_non_ssl_port` will be removed in favour of the property
`non_ssl_port_enabled` in version 4.0 of the AzureRM Provider.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
